app/views/items/show.html.erb


<% @item.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."item_id" = ?  [["item_id", 5]]