app/controllers/comments_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "item_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "sssssssssss"], ["item_id", 6], ["user_id", 18], ["created_at", "2017-10-28 09:57:42.292921"], ["updated_at", "2017-10-28 09:57:42.292921"]]
UPDATE "items" SET "status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["status", "无法修复"], ["updated_at", "2017-11-02 13:52:45.426511"], ["id", 1]]
---
  def create
      @comment = Comment.new(comment_params)
    #   @comment.content = comment_params[:content]
    #   @comment.user_id = comment_params[:user]
      item = Item.find(@comment.item_id)
      if @comment.save