app/controllers/items_controller.rb

    def create
        @item = Item.new(item_params)
        @item.status = "新报修"
        @item.user = current_user
        if @item.save
---
INSERT INTO "items" ("name", "info", "phone", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "台灯"], ["info", ""], ["phone", "13631329015"], ["email", "33@qq.com"], ["created_at", "2017-10-15 09:01:20.160581"], ["updated_at", "2017-10-15 09:01:20.160581"]]

    def index
        @items = Item.paginate(page: params[:page])
---
SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"

    def update
        @item = Item.find(params[:id])

        if @item.user.nil?
            pas = item_params.merge( {user: current_user})
        else
            pas = item_params
        end

        if @item.update(pas)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "items" SET "name" = ?, "status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "太湖之光"], ["status", "维修中"], ["updated_at", "2017-10-29 07:28:02.728225"], ["id", 980190964]]