app/controllers/sessions_controller.rb

    def create
        user = User.find_by(email:params[:session][:email].downcase)
        user = User.find_by(name:params[:session][:email]) unless user
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "adad"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "adad"], ["LIMIT", 1]]