app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    # @users = User.all
    @users = User.paginate(page: params[:page])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 18], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = ?  [["user_id", 18]]
---
  def show
      @user = User.find(params[:id])
      @uitems = @user.items.paginate(page: params[:page])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
  def crop
      @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "users" SET "avatar" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["avatar", "7051009_213317322251_2.png"], ["updated_at", "2017-10-14 02:43:39.072083"], ["id", 16]]
---
  def crop_update
    if params[:user].nil? || params[:user][:avatar].nil?
        @user = User.find(params[:id])
        render :crop
        return
    end
    @user = User.find(params[:id])
    if @user.update_attribute(:avatar,params[:user][:avatar])

INSERT INTO "users" ("name", "email", "school_serial", "phone", "curr_localtion", "gender", "created_at", "updated_at", "password_digest", "remember_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    # respond_to do |format|
      if @user.save

UPDATE "users" SET "school_serial" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["school_serial", "20071120121"], ["password_digest", "$2a$10$fSy49PBkw0faaF8yflkuIeIqP9zcJDOslSdYvhm8dlOaQwzDwMF32"], ["updated_at", "2017-10-29 08:55:37.722513"], ["id", 2]]
---
  def update
    # respond_to do |format|
      if params[:user] && @user.update(user_params)